# SpaceNumberOfPeople Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpaceNumberOfPeople Property
ParameterTypeId Class See Also
---
"Number of People"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpaceNumberOfPeople { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpaceNumberOfPeople As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpaceNumberOfPeople {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace